using System;
using System.Threading;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace FightClub
{
    //FIGHTER / БОЕЦ
    class Fighter {
        internal string Name;
        internal int Health = 1000;
        internal int Power;
        internal int Resistance = 100;

        public bool TryBlock() {
            var rnd = new Random();
            int res = rnd.Next(1, 5);
            return res > 3 ? true : false;
        }
    }

    class Program
    {

        static void RenderSpriteBlock(string name1, int health1, string name2, int health2) {
            Console.WriteLine(

               "                           ██░██░██                                           ░░░░░░░░░░░░░░░░░░░░░░░░░██████                          \n" +
               $"  {name1} {health1}HP            ██░██░████                                              ██████░░░░░░░░░░░░░░░░░░████████                          \n" +
                "                         ████░██░██░█                                     ██░░░░░███░░░░░░░░░░░░░░████████████                        \n" +
               $"                          █░░░░░░░░░░█                                   ██░░░░░░███░░░░░░░░░░░░░░█░░░░░░░░░░█       {name2} {health2}HP  \n" +
                "                         █░░░░░░░░░░█                                     █░░░░░░███░░░░░░░░░░░░░█░░░░░░░░░░█                         \n" +
                "                        ██░███░░███░█                                     █░░░░░█░░░░░░░░░░░░░░░████░░███░░██                         \n" +
                "                       █░█░░░█░░░░█░░█                          ░         ██░░░░██░░░░░░░░░░░░░░░█░█░░░░█░░░░░█                       \n" +
                "                         █░░░░░░░░░░░█                              ░     █░░░░░█░░░░░░░░░░░░░░░░█░░░██░░░░░░█                        \n" +
                "                         █░░████░░░░█                             ░    ░ █░░░░░░░█░░░░░░░░░░░░░░░░█░░████░░░░█                        \n" +
                "                          █░░░░░░█░██░░░░░░░░░░░░░░░░░░░█████████░█░█░  █░░░░░░░░░░░░░░░░░░░░░░░░░█░░░░░░█░██                         \n" +
                "                          ███░████░░█░░░░░░░░░░░░░░██░██░░░░░░░█████░█ █░░░░░░░░█████████░░░░░░░░░███░████░░█                         \n" +
                "               ███████░░██░███░░░░░█░░░░░░░░░░░░░██░░░░░░███████░█░███ █░░░░░░░░░░░░░░███████░░██░███░░░░░█░                          \n" +
                "           ░░░██░░░░░░████░░░░░░░░░░█░░░░░░░░░░░█░░░░█░░██░░░░░░░██ ░  █░░░░░░░░░░░░░░░░░░░░░████░░░░░░░░░░█                          \n" +
                "           ░██░░░░░░░░████░░░░░░░░░░█░░░░░██████░░░░░░███            ░ ██░░░░░░░░░░░░░░░░░░░░░████░░░░░░░░░░█                         \n" +
                "           ░█░░░░░░░░░░████░░░░░░░░░░█████████░░░░░░░██        ░  ░     ████░░░░░░░░░░░░░░░░░░████░░░░░░░░░░███████                   \n" +
                "           ░░░░░░░░░░░████░░░░░░░░░█████░░░██░░░░░░░██                   █████░░░░░░░░░░░░░░░░████░░░░░░░░░█████░░░██                 \n" +
                "           ░░░░░░░░░░██████░░░░░░░░██████░░░░█░░░█░█                        ███░░░░░░░░░░░░██████░░░░░░░░██████░░░░█                  \n" +
                "           ░░█░░░░░████████░░░░░████████░░░░░███████                          ██████░░░░░████████░░░░░████████░░░█░█                  \n" +
                "           ██░░█░░░███████████████████████░█░░░░█                                  ███████████████████████░█░░░░█░░█                  \n" +
                "           ░░░█░░████████████████████████░█░░░░█                                   ██████████████████████░█░░░░█░█                    \n" +
               $"           ░░░██████████████████████████████░█░                                     █████████████████████░█░░░░█                      \n" +
                "           ░░░░████████████████████████████                                          ██████████████████████░░░░█                      \n" +
                "           ░░░░░░░████████████████████████                                           ████████████████████░░░░░█                       \n"
                );}
   
        static void RenderSpriteAttack(string name1, int health1, string name2, int health2) {
            Console.WriteLine(

               "                           ██░██░██                                     ░██████                          \n" +
               $"  {name1} {health1}hp                 ██░██░████                                    ████████                          \n" +
                "                         ████░██░██░█                  ░░░░░░░░░░░░░░████████████                        \n" +
               $"                          █░░░░░░░░░░█                 ░░░░░░░░░░░░░░█░░░░░░░░░░█       {name2} {health2}hp  \n" +
                "                         █░░░░░░░░░░█                  ░░░░░░░░░░░░█░░░░░░░░░░█                         \n" +
                "                        ██░███░░███░█                  ░░░░░░░░░░░░░░████░░███░░██                         \n" +
                "                       █░█░░░█░░░░█░░█                ░░░░░░░░░░░░░░░█░█░░░░█░░░░░█                       \n" +
                "                         █░░░░░░░░░░░█                ░░░░░░░██████████░░░░░░░░░█                        \n" +
                "                         █░░████░░░░█                 ░░░░███░░░░░░░██░████░░░░█                        \n" +
                "                          █░░░░░░█░██░░░░░░░░░░░░░░░░██░██░░░░░█░█░███░████░░░█                        \n" +
                "                          ███░████░░█░░░░░░░░░░░░░░██░░░░░░░░██████░░░░░░░░░░███                        \n" +
                "               ███████░░██░███░░░░░█░░░░░░░░░░░░░██░░░░░░███░░░░░░░░░░░░███████░░██                          \n" +
                "           ░░░██░░░░░░████░░░░░░░░░░█░░░░░░░░░░░█░░░░█░░██░░░░░░░█░░░░░░░░░░░░░░░░░█                          \n" +
                "           ░██░░░░░░░░████░░░░░░░░░░█░░░░░██████░░░░░░███░░░░░░░░███░░░░░░░░░░░░░█████                         \n" +
                "           ░█░░░░░░░░░░████░░░░░░░░░░█████████░░░░░░░██ █░░░░░░░██░█░░░░░░░░░░░███████                   \n" +
                "           ░░░░░░░░░░░████░░░░░░░░░█████░░░██░░░░░░░██ █░░░░░░░██░█░░░░░░░░░░█████░░░██                 \n" +
                "           ░░░░░░░░░░██████░░░░░░░░██████░░░░█░░░█░█░  █░░░░░███░██░░░░█░░██████░░░░░░░█                  \n" +
                "           ░░█░░░░░████████░░░░░████████░░░░░███████   ██████░░░░░█████████░█░░░░░░░░░█░█                  \n" +
                "           ██░░█░░░███████████████████████░█░░░░█      ███████████████████████░█░░░░█░░█                  \n" +
                "           ░░░█░░████████████████████████░█░░░░█        ██████████████████████░█░░░░█░█                    \n" +
               $"           ░░░██████████████████████████████░█░          █████████████████████░█░░░░█                      \n" +
                "           ░░░░████████████████████████████                ██████████████████████░░░░█                      \n" +
                "           ░░░░░░░████████████████████████                 ████████████████████░░░░░█                       \n"
        );}



        static void Main(string[] args)
        {

            Console.WriteLine("Имя 1-го бойца: ");
            string User1 = Console.ReadLine();
            

            Console.WriteLine("Имя 2-го бойца: ");
            string User2 = Console.ReadLine();

            var rnd = new Random();
            Fighter Player1 = new Fighter { Name = User1, Power = rnd.Next(100,160)};
            Fighter Player2 = new Fighter { Name = User2, Power = rnd.Next(100, 160) };

            
            do {
                Thread.Sleep(2000);
                int randomAttack = rnd.Next(1,3);
                if (randomAttack == 1)
                {
                    
                    Console.WriteLine($"ПОПЫТКА АТАКОВАТЬ ИГРОКА ОТ {Player1.Name}a");
                    if (Player2.TryBlock() == true)
                    {
                        Console.ForegroundColor = ConsoleColor.Red;
                        Console.WriteLine("БЛОК!");
                        RenderSpriteBlock(Player1.Name, Player1.Health, Player2.Name, Player2.Health);
                        
                    }
                    else {
                        Console.ForegroundColor = ConsoleColor.Green;
                        Console.WriteLine("УСПЕШНАЯ АТАКА!");
                        Player2.Health -= Player1.Power;
                        RenderSpriteAttack(Player1.Name, Player1.Health, Player2.Name, Player2.Health);
                    }
                }
                else {
                    Console.WriteLine("ПОПЫТКА АТАКОВАТЬ ИГРОКА");
                    Thread.Sleep(1500);
                    if (Player1.TryBlock() == true)
                    {
                        Console.ForegroundColor = ConsoleColor.Red;
                        Console.WriteLine("БЛОК!");
                        RenderSpriteBlock(Player2.Name, Player2.Health, Player1.Name, Player1.Health);
                    }
                    else
                    {
                        Console.ForegroundColor = ConsoleColor.Green;
                        Console.WriteLine("УДАЧНАЯ АТАКА!");
                        Player1.Health -= Player2.Power;
                        RenderSpriteAttack(Player2.Name, Player2.Health, Player1.Name, Player1.Health);
         
                    }
                }
            }
            while (Player1.Health > 0 && Player2.Health > 0);

        }
    }
}
